Tekla.Structures.Model.Component
The Component class represents a component. A component is a modelling tool that typically
assembles multiple parts to build some type of a structure, for example a hall macro or at a
smaller scale a reinforcement component (a macro). Also, a custom part is a component.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Beam myBeam = new Beam(new Point(12000, 0, 0), new Point(12000, 6000, 0));
myBeam.Profile.ProfileString = "380*380";
myBeam.Material.MaterialString = "Concrete_Undefined";
if (myBeam.Insert())
{
Component myComponent = new Component();
myComponent.Name = "Beam Reinforcement";
myComponent.Number = 30000063;
ComponentInput CI = new ComponentInput();
CI.AddInputObject(myBeam);
myComponent.SetComponentInput(CI);
myComponent.LoadAttributesFromFile("standard");
myComponent.SetAttribute("side_bar_space", 333.0);
if (!myComponent.Insert())
{
Console.WriteLine("Component Insert failed");
}
else
{
Console.WriteLine(myComponent.Identifier.ID);
Double DValue = 0.0;
if (!myComponent.GetAttribute("side_bar_space", ref DValue) || DValue != 333)
Console.WriteLine("Component GetAttribute failed");
}
}
}
}

Tekla.Structures.Model.Component.#ctor
Creates a new component instance.

Tekla.Structures.Model.Component.#ctor(Tekla.Structures.Model.ComponentInput)
Creates a new component instance with the given component input.
I: The component input to be used for the component.

Tekla.Structures.Model.Component.SetComponentInput(Tekla.Structures.Model.ComponentInput)
Sets the component input object for the component. The component input object
contains all the input objects and positions that are needed for the
component creation.
I: The component input object.
Returns: True if the input is received.

Tekla.Structures.Model.Component.GetComponentInput
Returns the component input object.
Returns: The component input object.

Tekla.Structures.Model.Component.GetBooleans
Returns an enumerator of all the connected boolean objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Component.GetAssembly
Returns the assembly that the component belongs to.
Returns: The assembly that the component belongs to.

Tekla.Structures.Model.Component.Insert
Inserts the component into the model database. The component input needs to be set.
Returns: True on success.

Tekla.Structures.Model.Component.Select
Selects a component from the model database. The component ID must be set.
Returns: True on success.

Tekla.Structures.Model.Component.Modify
Modifies the existing component in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.Component.Delete
Deletes the component instance with the given ID from the model database.
Returns: True on success.

Tekla.Structures.Model.Component.GetComponents
Returns an enumerator of all the connected components.
Returns: A ModelObjectEnumerator on success, otherwise null.